DataProcessors/DMS_РегистрацияВходящихЗвонков.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<DataProcessor>
		<Properties>
			<Name>DMS_РегистрацияВходящихЗвонков</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Адрес</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Порт</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Логин</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пароль</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВнутреннийНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтрокаНабора</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контекст</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автоподключение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПутьКФайлуВК</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>NativeAPI</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетчикЗвонков</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

DataProcessors/DMS_РегистрацияВходящихЗвонков/Ext/ObjectModule.bsl
//******************************************************************************
// (c)Компания Simplit, http://simplit.com.ua
// Киев, 2012
//******************************************************************************
Перем Телефония Экспорт;

////////////////////////////////////////////////////////////////////////////////
// ФУНКЦИИ РАБОТЫ С ВНЕШНЕЙ КОМПОНЕНТОЙ
////////////////////////////////////////////////////////////////////////////////

Функция ПолучитьАдресВнешнейКомпоненты(Адрес) Экспорт;

	Макет=ПолучитьМакет("ROM_Asterisk_Native");
	Возврат ПоместитьВоВременноеХранилище(Макет,Адрес); 

КонецФункции

Функция ИнициализироватьТелефонию() Экспорт;
	// кроме веб-клиента
	#Если ВебКлиент Тогда
		Возврат Ложь;
	#КонецЕсли
	
	Причина="";
    Попытка
		Телефония = Новый ("AddIn.ROM-Asterisk");
	Исключение
		Сообщить("Не создать объект внешней компоненты для связи с Asterisk."+ОписаниеОшибки());
		Возврат Ложь;
	КонецПопытки; 
	
	Возврат Истина;
КонецФункции // ИнициализироватьТелефонию

Функция ЗагрузитьКомпонентуТелефонии()Экспорт;

	// кроме веб-клиента
	#Если ВебКлиент Тогда
		Возврат Ложь;
	#КонецЕсли
	
	// константы определим отдельно, чтобы легко было менять на свои
	// Каталог="C:\Program Files\1cv82\";
	Настройки = Справочники.Renault_СлужебныеНастройкиБазыДанных[ПараметрыСеанса.DMS_Бренд.Наименование];
	Каталог=Настройки.ПутьКФайлуВкAsterisk;
	ИмяВК="ROM-Asterisk";
	ФайлВК = Новый Файл(Каталог+"\"+ИмяВК+".dll");
	
	Если ФайлВК.Существует()=Ложь Тогда
		Сообщить("Не найден файл внешней компоненты для связи с Asterisk");
		Возврат Ложь;
	КонецЕсли; 
	
	Попытка
		
		#Если ТолстыйКлиентОбычноеПриложение или ТолстыйКлиентУправляемоеПриложение Тогда
			Попытка
				ЗагрузитьВнешнююКомпоненту(ФайлВК.ПолноеИмя);
			Исключение
				Сообщить("Не удалось подключить загрузить компоненту для связи с Asterisk");
				Возврат Ложь;
			КонецПопытки; 
		#Иначе
			Если ПодключитьВнешнююКомпоненту("AddIn."+ИмяВК)=Ложь Тогда
				Сообщить("Не удалось подключить внешнюю компоненту для связи с Asterisk в режиме тонкого клиента");
				Сообщить("Если это первый запуск, то нужно войти в режиме толстого клиента");
				Возврат Ложь;
			КонецЕсли; 
		#КонецЕсли
		
		Возврат Истина;
		
	Исключение
		Сообщить("Не удалось загрузить внешнюю компоненту для связи с Asterisk");
	КонецПопытки;
	
	Возврат Ложь;
	
КонецФункции // ЗагрузитьКомпонентуТелефонии

Функция Подключиться(Адрес,Порт,Логин,Пароль) Экспорт;
	Телефония.Подключиться(Адрес,Порт);
	Login(Логин,Пароль);
КонецФункции


Функция Отключиться() Экспорт;
	Телефония.Отключиться();
КонецФункции // Отключиться

// Выполнить команду AMI
//
// Параметры
//  СтрокаКоманды	- Строка - в формате AMI
//
// Возвращаемое значение:
//   Число   - 1-команда успешно отправлена, 0 -нет
//
Функция ВыполнитьКоманду(СтрокаКоманды) Экспорт;
	// кроме веб-клиента
	#Если ВебКлиент Тогда
		Возврат 0;
	#КонецЕсли
	CRLF = Chars.CR + Chars.LF;
	// проверка завершения пакета
	Если Найти(СтрокаКоманды,CRLF+CRLF)=0 Тогда
		Сообщить("ВыполнитьКоманду: Неверный формат команды: "+CRLF+СтрокаКоманды);
		Возврат 0;
	КонецЕсли;
	Попытка
		Результат=Телефония.ВыполнитьКоманду(СтрокаКоманды);
	Исключение
	КонецПопытки;
	Если Результат=1 Тогда
		Возврат Истина;
	КонецЕсли; 
	Возврат Ложь;

КонецФункции // ВыполнитьКоманду()

// Управление фильтром событий AMI Asterisk
//
// Параметры:
//	СтрФильтра:	Строка - фильтры, согласно спецификации AMI
//
// Возвращаемое значение:
//	Число	: 1-команда успешно отправлена, 0-нет
//
Функция УстановитьФильтрСобытий(СтрокаФильтра="")Экспорт;
	Возврат Event(СтрокаФильтра);
КонецФункции // УстановитьФильтрСобытий

// Установить фильтр - регулярное выражение
//
// Параметры
//  СтрокаФильтра	- Строка - регулярное выражение
//
// Возвращаемое значение:
//   Число   - 1-фильтр установлен, 0 -нет
//
Функция УстановитьФильтр(СтрокаФильтра) Экспорт;

	Телефония.УстановитьРегулярноеВыражение(СтрокаФильтра);

КонецФункции // УстановитьФильтр

// Включение/Отключение режима подписки на внешние события
//
// Параметры:
//	Режим	: - Число - 1-включить, 0-выключить
//
// Возвращаемое значение:
//	Число	: режим подписки после выполнения метода
//
Функция ПодписатьсяНаВнешниеСобытия(Режим) Экспорт;
	ТекущийРежим=Телефония.РежимПрослушивания;
	// корректируем принимаемый параметр
	Режим = ?(Режим<0,0,Режим);
	Режим = ?(Режим>1,1,Режим);
	Если Режим - ТекущийРежим > 0 Тогда
		Телефония.РежимПрослушивания(Режим);
	КонецЕсли;
	Возврат Телефония.РежимПрослушивания;
КонецФункции // ПодписатьсяНаВнешниеСобытия()


////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ФУНКЦИИ
////////////////////////////////////////////////////////////////////////////////

// Возвращает коллекцию типа соответствие
// Вход	:
//			СтрДанные - строка с разделителями
// Выход:
//			ДанныеСобытия - Соответствие
Функция ДанныеВСоответствие(Знач Данные) Экспорт;
	
	Массив=Новый Соответствие;
	СтрБуфер=Данные;
	// Пакет может быть завершен CR-ом, без LF-а. Дополним...
	Если Прав(СтрБуфер,1)=Chars.CR Тогда
		СтрБуфер=СтрБуфер+Chars.LF;
	КонецЕсли; 
	
	// переменные для разбора строк
	CRLF=Chars.CR+Chars.LF;
	КолвоСтрок=СтрЧислоВхождений(СтрБуфер,CRLF);
	ДлинаCRLF=СтрДлина(CRLF);
	
	// переменные для разбора ключ-значение, внутри строки
	Разделитель=": ";
	ДлинаРазделителя=СтрДлина(Разделитель);

	Для Индекс=1 По КолвоСтрок Цикл
		// выборка строк, разделенных CRLF
		ПозицияCRLF=Найти(СтрБуфер,CRLF);
		ТекСтрока=Лев(СтрБуфер,ПозицияCRLF-1);
		
		// в строке, ключ и значение разделены ": "
		ПозицияРазделителя=Найти(СтрБуфер,Разделитель);
		Ключ=Лев(ТекСтрока,ПозицияРазделителя-1);
		Значение=Сред(ТекСтрока,ПозицияРазделителя+ДлинаРазделителя);
		Если ЗначениеЗаполнено(Ключ) Тогда
			Массив.Вставить(Ключ,Значение);
		КонецЕсли; 
		
		// отрезаем прочитанную часть
		СтрБуфер=Сред(СтрБуфер,ПозицияCRLF+ДлинаCRLF);
		
	КонецЦикла; 
	
	Возврат Массив;

КонецФункции //ДанныеВСоответствие
 

////////////////////////////////////////////////////////////////////////////////
// КОМАНДЫ ASTERISK
////////////////////////////////////////////////////////////////////////////////

// Авторизация в Asterisk Manager API
//
// Возвращаемое значение: 1-команда отправлена, 0-нет
//
Функция Login(Логин,Пароль) Экспорт;

	Если ПустаяСтрока(Логин) Тогда
		Сообщить("Login(). Не указан параметр <Логин>");
		Возврат 0;
	КонецЕсли; 
	
	Если ПустаяСтрока(Пароль) Тогда
		Сообщить("Login(). Не указан параметр <Пароль>");
		Возврат 0;
	КонецЕсли; 
	
	Если Телефония.Подключено=1 Тогда
		CRLF = Chars.CR + Chars.LF;
		СтрокаКоманды= "Action: Login"+CRLF+
		"Username: "+Логин+CRLF+
		"Secret: "+Пароль+CRLF+CRLF;
		Возврат ВыполнитьКоманду(СтрокаКоманды);
	КонецЕсли; 

КонецФункции // Login
 
// Завершения сеанса Asterisk Manager API и закрытие соединения
//
// Возвращаемое значение: 1-команда отправлена, 0-нет
//
Функция Logoff() Экспорт;

	CRLF = Chars.CR+Chars.LF;
	ТекстКоманды = "Action: Logoff"+CRLF+CRLF;
	Возврат ВыполнитьКоманду(ТекстКоманды);

КонецФункции // Logoff
 
// Команда оригинации (по сути, совершение исходящего звонка)
//
// Параметры:
//		Приемник	-	Строка - Кому звоним. Экстен для используемый для соединения (используется только совместно с параметрами Context и Priority)
//		Источник	-	Строка - Название канала, с которого совершается исходящий вызов (В том же формате, как если бы Вы совершали вызов этому абоненту командой Dial)
//		Контекст	-	Строка - Название контекста для совершения исходящего вызова (используется только совместно с параметрами Exten и Priority)
//		Таймаут		-	Строка - Таймаут (в миллисекундах) для соединения с инициатором исходящего вызова (значение по умолчанию: 30000 миллисекунд)
//		Приоритет	-	Строка - Приоритет (используется только совместно с параметрами Context и Exten)
//		ИДНомера	-	Строка - Значение CallerID-источника, используемое для совершения исходящего вызова.
//		СтрокаПерем	-	Строка - Установка переменных канала (максимум 32). Переменные будут установлены для обоих каналов, участвующих в соединении (локального, для абонента от которого совершается вызов и для вызываемого канала)
//		Account		-	Строка - Значение для "Account code" исходящего вызова
//		Application	-	Строка - Команда плана набора, используемая для совершения исходящего вызова (используется параметр "Data", для указания ее параметров)
//		Данные		-	Строка - Параметры команды плана набора, используемой для совершения исходящего вызова
//		ФлагАсинхр	-	Если указано "true" исходящий вызов будет производиться асинхронно. Результат ее выполнения будет возвращен позже, в пакете типа "Event" (позволяет осуществлять несколько вызовов без ожидания результата предыдущей команды, совершающей исходящий вызов)
//		ИД			-	Строка - Необязательный ID команды, который будет возвращен в ответе. Позволяет сопоставить результат выполнения конкретному запросу. 
//								В качестве значения можно использовать или номер или строку. 
//								Очень полезно использовать, когда выполняется несколько асинхронных запросов одновременно
//
// Возвращаемое значение: 1-команда отправлена, 0-нет
//
Функция Originate(Приемник, Источник, Контекст, Таймаут="30000", Приоритет="1", ИДНомера="", СтрокаПерем="", КодУчетной="", КомандаНабора="", ДанныеНабора="", ФлагАсинхр="false", ИД="") Экспорт;

	CRLF = Chars.CR + Chars.LF;
	
	Если ПустаяСтрока(Приемник) Тогда
		Сообщить("Originate(). Ошибка. Не указан номер, на который выполняется звонок");
		Возврат 0;
	КонецЕсли; 
	
	Если ПустаяСтрока(Источник) Тогда
		Сообщить("Originate(). Ошибка. Не указан номер-источник, с которого выполняется звонок");
		Возврат 0;
	КонецЕсли; 
	
	Если ПустаяСтрока(Контекст) Тогда
		Сообщить("Originate(). Ошибка. Не указан контекст");
		Возврат 0;
	КонецЕсли; 
	
	Если ПустаяСтрока(ИДНомера) Тогда
		ИДНомера = Источник;
	КонецЕсли; 
	
	Если ПустаяСтрока(СтрокаПерем) Тогда
		СтрокаПерем = "";
	КонецЕсли; 
	
	ТекстКоманды="Action: Originate"+CRLF+
	"Channel: "+Источник+CRLF+
	"Context: "+Контекст+CRLF+
	"Exten: "+Приемник+CRLF+
	"Priority: "+Приоритет+CRLF+
	"Callerid: "+ИДНомера+CRLF+
	"Timeout: "+Таймаут+CRLF;
	
	Если ПустаяСтрока(СтрокаПерем)=Ложь Тогда
		ТекстКоманды = ТекстКоманды + "Variable: "+СтрокаПерем+CRLF;
	КонецЕсли; 
	
	Если ПустаяСтрока(КодУчетной)=Ложь Тогда
		ТекстКоманды = ТекстКоманды + "Account: "+КодУчетной+CRLF;
	КонецЕсли; 
	
	Если ПустаяСтрока(КомандаНабора)=Ложь Тогда
		ТекстКоманды = ТекстКоманды + "Application: "+КомандаНабора+CRLF;
	КонецЕсли; 
	
	Если ПустаяСтрока(ДанныеНабора)=Ложь Тогда
		ТекстКоманды = ТекстКоманды + "Data: "+ДанныеНабора+CRLF;
	КонецЕсли; 
	
	ТекстКоманды = ТекстКоманды +
	"Async: "+ФлагАсинхр+CRLF;
	
	Если ПустаяСтрока(ИД)=Ложь Тогда
		ТекстКоманды = ТекстКоманды + "ActionID: "+ИД+CRLF;
	КонецЕсли; 
	ТекстКоманды = ТекстКоманды + CRLF;
	
	Возврат ВыполнитьКоманду(ТекстКоманды);


КонецФункции // Originate
 
// Авторизация в Asterisk Manager API
//
// Возвращаемое значение: 1-команда отправлена, 0-нет
//
Функция Event(СтрокаФильтр="on", ИД="") Экспорт;

	CRLF = Chars.CR + Chars.LF;
	ТекстКоманды="Action: Events"+CRLF+
	"EventMask: "+СтрокаФильтр+CRLF;
	
	Если ПустаяСтрока(ИД)=Ложь Тогда
		ТекстКоманды = ТекстКоманды + "ActionID: "+ИД+CRLF;
	КонецЕсли; 
	ТекстКоманды = ТекстКоманды + CRLF;
	
	Возврат ВыполнитьКоманду(ТекстКоманды);
	
КонецФункции // Event
 
////////////////////////////////////////////////////////////////////////////////
// ПОЛЬЗОВАТЕЛЬСКИЕ КОМАНДЫ
////////////////////////////////////////////////////////////////////////////////

// Отправка команды на исходящий звонок
//
// Параметры:
//	Куда	-	Строка - Номер куда звонить
//
// Возвращаемое значение:
//	Число	: 1-команда успешно отправлена, 0-нет
//
// Описание:
// Сначала, звонок отправляется 1-му каналу, т.е. оператору на внутренний номер. 
// Только после того, как оператор поднял трубку, т.е. 1-й канал создан, 
// будет выполнен вызов 2-го канала, т.е. внешнего абонента 
//
Функция Звонить(Куда) Экспорт;
	CRLF = Chars.CR + Chars.LF;
	Если ПустаяСтрока(Куда) Тогда
		Сообщить("Звонить(). Ошибка. Не указан номер куда выполняется звонок");
		Возврат 0;
	КонецЕсли;
	Протокол	= "SIP/"; // еще может быть IAX2
	Откуда 		= Протокол+ВнутреннийНомер;
	Таймаут		= "30000";

	Возврат Originate(Куда, Откуда, Контекст, Таймаут, 1, ВнутреннийНомер);

КонецФункции // Звонить

Функция ЗаписатьМакет(ПолноеИмяФайла) Экспорт;
	Макет=ПолучитьМакет("ROM_Asterisk");
	Если Макет<>Неопределено Тогда
		Макет.Записать(ПолноеИмяФайла);
	КонецЕсли; 
КонецФункции
